_과일종류 = {'사과':1000,'포도':3000,'배':2000,'귤':500}
_과일=list(_과일종류.keys())
_사는갯수=[0,0,0,0] # 각각 사는 과일 갯수
_사는가격=[0,0,0,0] # 각각 사는 과일의 금액
_총금액=0
while True:
  a=input("구입하려는 과일의 이름을 입력하세요.(입력을 종료하려면 q) : ")
  if a == 'q' or a =='Q':
    break
  b=int(input("구입하려는 과일의 개수를 입력하세요. : "))
  _사는갯수[_과일.index(a)]+=b
  _총금액+=_과일종류[a]*b
  _사는가격[_과일.index(a)] = _사는갯수[_과일.index(a)]*_과일종류[a]
if _사는갯수[1] >=3 :
  _총금액*=0.9
_사는갯수[3] += (_사는갯수[3]//10) *2
print('귀하는 ',end='')
for c in range(0,4):
  if(_사는갯수[c]) >0:
    print(_과일[c]+'->'+str(_사는갯수[c])+' : 금액 '+str(_사는가격[c]),end=' ')
print('총 금액 %d입니다.' %_총금액)
